srshop/app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"
---
  def index
    @shops = Shop.all